tap "adoptopenjdk/openjdk"
tap "dracula/install"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "pulumi/tap"
tap "qmk/qmk"
tap "stripe/stripe-cli"
# Run your GitHub Actions locally
brew "act"
# Library for manipulating PNG images
brew "libpng"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cross-platform make
brew "cmake"
# Image processing and image analysis library
brew "leptonica"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Parser generator for use with Java applications
brew "javacc"
# Image manipulation library
brew "jpeg"
# Library for command-line editing
brew "readline"
# Powerful, lightweight programming language
brew "lua"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node"
# Tool for managing OCI containers and pods
brew "podman"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Development kit for the Java programming language
brew "openjdk@11"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Command-line interface for 1Password
cask "1password-cli"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Dark theme for Terminal.app
cask "dracula-terminal"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "git-credential-manager-core"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Minimal installer for conda
cask "miniconda"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
vscode "akamud.vscode-theme-onedark"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EliverLara.andromeda"
vscode "Equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "janisdd.vscode-edit-csv"
vscode "KevinRose.vsc-python-indent"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
vscode "WallabyJs.console-ninja"
vscode "zhuangtongfa.material-theme"
